In [1]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [2]:
data = pd.read_csv('kg-okitsu.csv', sep = ";",decimal=',')

In [3]:
data

     ID_REGISTRO  ID_PARCELA     Area  Lluvia_Temporada       KG
0              1           1  3696.29             324.0  11130.0
1              2           2  1469.21             324.0   3216.0
2              3           3  1529.87             324.0      NaN
3              4           4  6247.46             324.0  24366.0
4              5           5  2763.91             324.0   3031.0
..           ...         ...      ...               ...      ...
310          311          59  3768.59             259.8   6653.0
311          312          60  2499.65             259.8  13249.0
312          313          61  1349.54             259.8   6937.0
313          314          62   531.84             259.8   1389.0
314          315          63  2478.04             259.8  11668.0

[315 rows x 5 columns]

In [4]:
data.dtypes

ID_REGISTRO           int64
ID_PARCELA            int64
Area                float64
Lluvia_Temporada    float64
KG                  float64
dtype: object

In [5]:
data.isnull().sum()

ID_REGISTRO          0
ID_PARCELA           0
Area                 0
Lluvia_Temporada     0
KG                  48
dtype: int64

In [6]:
data = data.dropna()

In [7]:
data.isnull().sum()

ID_REGISTRO         0
ID_PARCELA          0
Area                0
Lluvia_Temporada    0
KG                  0
dtype: int64

In [8]:
data

     ID_REGISTRO  ID_PARCELA     Area  Lluvia_Temporada       KG
0              1           1  3696.29             324.0  11130.0
1              2           2  1469.21             324.0   3216.0
3              4           4  6247.46             324.0  24366.0
4              5           5  2763.91             324.0   3031.0
5              6           6  2715.71             324.0   9512.0
..           ...         ...      ...               ...      ...
310          311          59  3768.59             259.8   6653.0
311          312          60  2499.65             259.8  13249.0
312          313          61  1349.54             259.8   6937.0
313          314          62   531.84             259.8   1389.0
314          315          63  2478.04             259.8  11668.0

[267 rows x 5 columns]

In [9]:
x = data[['Area', 'Lluvia_Temporada']]

In [10]:
x

        Area  Lluvia_Temporada
0    3696.29             324.0
1    1469.21             324.0
3    6247.46             324.0
4    2763.91             324.0
5    2715.71             324.0
..       ...               ...
310  3768.59             259.8
311  2499.65             259.8
312  1349.54             259.8
313   531.84             259.8
314  2478.04             259.8

[267 rows x 2 columns]

In [11]:
y = data[['KG']]

In [12]:
y

          KG
0    11130.0
1     3216.0
3    24366.0
4     3031.0
5     9512.0
..       ...
310   6653.0
311  13249.0
312   6937.0
313   1389.0
314  11668.0

[267 rows x 1 columns]

In [13]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [14]:
model=LinearRegression().fit(x_train,y_train)

In [15]:
model.score(x_test,y_test)

0.474291301459283

In [17]:
x_test.shape, x_train.shape

((54, 2), (213, 2))